---
title: BuildingPadType
classe: Autodesk.Revit.DB.BuildingPadType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObjAttributes
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# BuildingPadType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ThermalProperties ThermalProperties { get; }` | `buildingPadType.ThermalProperties` | ThermalProperties |
| `BuildingPadType CreateDefault(Document)` | `BuildingPadType.CreateDefault(document)` | BuildingPadType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```